{
    "1": {
        "name": "",
        "email": "",
        "phone": "",
        "location": "",
        "skills": [],
        "enrolled": {}
    },
    "12": {
        "name": "Example",
        "email": "example@gmail.com",
        "phone": "9999888810",
        "location": "Pune",
        "skills": "Python, Java, JavaScript, Something, Else, Etc.",
        "resume_path": "12_resume.pdf",
        "enrolled": {
            "TechCorp": {
                "4": {
                    "[    Describe your experience using SQL for data analysis, specifically focusing on any experience with complex queries involving joins and subqueries.,    Can you explain a time you had to analyze a large dataset to identify a specific trend or pattern? What methods did you use?,    Have you utilized any data visualization tools to communicate findings from your analysis?  Which tools and why?,    Describe your experience with Agile methodologies, specifically sprint planning and backlog grooming.,    How familiar are you with different market research methodologies (e.g., surveys, focus groups, A/B testing)?,    Explain your understanding of SWOT analysis and its application in a business context.,    Let’s say a key metric shows a sudden and unexpected drop.  Outline your approach to troubleshooting the issue.,    How would you approach the analysis of qualitative data, such as customer feedback or interview transcripts?,    What experience do you have with different types of business models (e.g., B2B, B2C, subscription)?,    Have you worked with any project management software (e.g., Jira, Asana, Trello)? If so, which and how?,    Describe a situation where you had to present complex information to a non-technical audience. How did you ensure they understood?,    What are your preferred methods for conducting competitive analysis?,    What is your experience with creating and maintaining business requirements documents?,    Describe your familiarity with different data modeling techniques.  ": "something",
                    "[    Give an example of a complex SQL query you've written involving a LEFT JOIN and a subquery.  What was the purpose?,    When analyzing large datasets, what techniques do you use to handle missing or inconsistent data?,    Compare and contrast Tableau and Power BI.  Which would you choose for a specific task and why?,    Describe your experience with Agile sprint retrospectives and how you've contributed to process improvement.,    Beyond surveys, what's one unconventional market research method you find promising, and why?,    How would you adapt a SWOT analysis for a rapidly changing market?,    In troubleshooting that metric drop, what's the FIRST thing you check?,    How do you ensure the objectivity of your qualitative data analysis?,    How might the marketing strategy differ between a B2B SaaS and a B2C e-commerce business?,    Compare the strengths and weaknesses of Jira and Asana from a Business Analyst perspective.,    How would you simplify explaining a regression analysis to someone without a statistical background?,    Describe your experience using Porter's Five Forces framework in competitive analysis.,    Give an example of a specific business requirement you've documented.  What was its impact?,    Explain the difference between star schema and snowflake schema in data modeling.  ": "something",
                    "[    What specific SQL functions have you used to handle NULL values in your analysis?,    In your experience, what are the limitations of using only A/B testing in market research?,    Describe a situation where a SWOT analysis led to a significant change in business strategy.,    What's one metric you would prioritize monitoring to detect a potential problem BEFORE it significantly impacts a key business objective?,    How do you approach identifying and mitigating bias when analyzing qualitative data?,    What are the key differences in user acquisition strategies between a B2C and B2B subscription model?,    Beyond task management, how have you leveraged the reporting features of your preferred project management software?,    How would you explain the concept of opportunity cost to a non-finance stakeholder?,    Give a specific example of how you used Porter's Five Forces to inform a competitive strategy recommendation.,    Describe a scenario where you had to revise a business requirement document due to changing project needs.,    What are the advantages and disadvantages of using a dimensional model (like a star schema) versus an Entity-Relationship model for data warehousing?  ": "somethging",
                    "[    What specific SQL functions are you most proficient with, and in what analytical contexts have you applied them?,    Describe a situation where you had to deal with missing data points in a large dataset – what was your approach?,    Beyond Tableau and Power BI, what other data visualization tools are you familiar with, and what are their relative strengths?,    Give a concrete example of how you've used Agile sprint retrospectives to improve team performance.,    Name a recent market trend you've identified through research, and explain your methodology.,    Describe a situation where a SWOT analysis highlighted an unforeseen opportunity.,    What's the first question you ask when investigating a data anomaly?,    How would you identify and classify different types of biases in qualitative data?,    Outline the key differences in customer lifecycle management between B2B and B2C models.,    How have you used project management software to enhance collaboration and communication within a team?,    How would you explain the concept of 'correlation vs. causation' to a non-technical stakeholder?,    Describe your experience leveraging Porter's Five Forces to identify a potential market disruption.,    Give a brief example of a poorly written business requirement and explain how you would improve it.,    Beyond star and snowflake schemas, what other data modeling techniques are you familiar with, and when would you use them?  ": "something",
                    "[    What specific SQL functions are you most proficient with, and in what contexts have you used them for business analysis?,    Describe a recent analysis where you had to handle missing data; what strategies did you employ?,    Beyond Tableau and Power BI, what other data visualization tools have you used, and what are their strengths and weaknesses for different types of data?,    Give an example of an Agile sprint retrospective where you contributed to process improvement—what was the issue, your contribution, and the outcome?,    What's a non-traditional market research approach you've explored, and how did it provide insights that traditional methods may have missed?,    Describe a scenario where your SWOT analysis revealed a competitive advantage previously overlooked; what was the opportunity, and how did you capitalize on it?,    What's your immediate process for investigating an unexpected spike or dip in a key business metric?,    How do you ensure you're objectively analyzing qualitative data—what steps do you take to mitigate bias?,    Compare and contrast customer acquisition strategies for a B2B and a B2C subscription business, highlighting specific differences.,    How have you used project management tools to proactively identify and mitigate potential project risks?,    How would you explain the concept of regression analysis to someone with no statistical background?,    Give a practical example of how Porter's Five Forces helped inform your analysis of a specific market segment.,    Describe a situation where you had to revise or clarify a business requirement document because of stakeholder feedback or evolving project needs.,    Beyond star and snowflake schemas, what data modeling techniques are you familiar with and when would you choose to use them?  ": "something\r\n",
                    "average_emotion": null,
                    "video_interview_answers": [],
                    "recommend": "Please provide the questions and answers.\n"
                }
            }
        },
        "profile_pic": "12_profile.jpg"
    }
}